#1. ცვლადში შეინახე სტრინგი დიდი ასოებით, შემდეგ .lower() ფუნქციის მეშვეობით გადააქციე ცვლადი პატარა ასოებად. 

name = "NINO"
print(name.lower())

#2. ცვლადში შეინახე სტრინგი პატარა ასოებით, შემდეგ .upper() ფუნქციის მეშვეობით გადააქციე ცვლადი დიდ ასოებად.

name = "goal oriented academy"
print(name.upper())

#3. ცვლადში შეინახე სტრინგი პატარა ასოებით, შემდეგ .capitalize() ფუნქციის მეშვეობით გადააქციე პირველი ასო დიდ 
# ასოდ.

subject = "georgian"
print(subject.capitalize())



#მომხარებელს შემოატანინე სიტყვა, შემდეგ გადააქციე პატარა ასოებად და დაპრინტე.

word = input("write with capital letters: ")

print(word.lower())
