#1. შექმენით სია, სადაც გექნებათ 5 ელემენტი, შემდეგ, დადებითი ინდექსინგის გამოყენებით გამოიტანეთ მე-3 და მე-4.

list = ["math", "english", "georgian", "PE", "music"]
print(list[3:5])

#2. შექმენით სია, სადაც გექნებათ 5 ელემენტი, შემდეგ, უარყოფითი ინდექსინგის გამოყენებით გამოიტანეთ მესამე ელემენტი.

list = ["math", "english", "georgian", "PE", "music"]
print(list[-3])

#3. შექმენით სია, სადაც გექნებათ 5 რიცხვი, შემდეგ დაპრინტე მათი მინიმალური რიცხვი და მაქსიმალური რიცხვი.

numbers = [22,34,11, 1, 6, 77]
print(min(numbers))
print(max(numbers))