// 1. შექმენი პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 10-მდე while loop-ის გამოყენებით, თუმცა თითოეული რიცხვი უნდა იყოს დაბეჭდილი ახალ ხაზზე console.log()-ის გამოყენებით.
// 2. შექმენი პროგრამა, რომელიც ბეჭდავს ყველა კენტ რიცხვს 1-დან 20-მდე while loop-ის გამოყენებით.
// 3. შექმენი პროგრამა, რომელიც იყენებს  while loop-ს 1-დან 20-მდე ყველა რიცხვის ჯამის გამოსათვლელად და შედეგი კონსოლში გამოაქვს.
// 4. შექმენი პროგრამა, რომელიც დაბეჭდავს ციფრებს 5-დან 25-მდე 5-იანი გამოტოვებით, while loop-ის გამოყენებით.
// 5. შექმენი პროგრამა, რომელიც დაბეჭდავს 7-ს კონსოლში, while loop-ის გამოყენებით, მხოლოდ ერთხელ უნდა გაეშვას ციკლი.

// 1

let i = 1;

while (i <= 10) {
  console.log(i);
  i++;
}


// 2

let x = 1;

while (x <= 20) {
  if (x % 2 !== 0) {
    console.log(x);
  }
  x++;
}


// 3

let y = 1;
let sum = 0;

while (y <= 20) {
  sum += y;
  y++;
}

console.log(sum);


// 4

let k = 5;

while (k <= 25) {
  console.log(k);
  k += 5;
}


// 5

let m = 1;

while (m <= 10) {
    console.log(m)
    m +=7;
}


// 1. შექმენი პროგრამა, რომელიც ბეჭდავს ნომრებს 1-დან 10-მდე კონსოლზე for loop-ის გამოყენებით, თუმცა თითოეული რიცხვი უნდა დაიბეჭდოს იმავე ხაზზე, გამოყოფილი მძიმეებით.
// 2. შექმენი პროგრამა, რომელიც ბეჭდავს ნომრებს 2, 4, 6, 8, 10 კონსოლში for loop-ის გამოყენებით (მხოლოდ ლუწი რიცხვები 1-დან 10-მდე).
// 3. შექმენი პროგრამა, რომელიც გამოთვლის და დაბეჭდავს ყველა რიცხვის ჯამს 1-დან 100-მდე for loop-ის გამოყენებით.

// 1

let result = "";

for (let i = 1; i <= 10; i++) {
  result += i;
  if (i < 10) {
    result += ", ";
  }
}

console.log(result);


// 2

for (let i = 2; i <= 10; i += 2) {
    console.log(i);
  }


// 3

let sum1 = 0;

for (let i = 1; i <= 100; i++);{

sum1 += i;

}
console.log(sum)
